---
kind: other
id: Methods.T:Autodesk.Revit.DB.AssemblyType
source: html/ab01052e-f746-ffc4-1219-5a83c5547b04.htm
---
# AssemblyType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.